
// Внешние методы
#Область ПрограммныйИнтерфейс

// Процедура - Создать запись
//
// Параметры:
//  соотвПолейЗвонков - Структура - ВСЕ измерения + Ресурсы
//
Процедура СоздатьЗапись( соотвПолейЗвонков ) Экспорт 
	ДобавлятьСобытия = Истина;
	
	// обязательное Измерения!
	Если НЕ соотвПолейЗвонков.Свойство("Номер")
		ИЛИ НЕ соотвПолейЗвонков.Свойство("Входящий") Тогда
		Возврат; 	
	КонецЕсли;
	
	рс = РегистрыСведений.ИсторияЗвонков.СоздатьМенеджерЗаписи();
	
	Для каждого эл Из соотвПолейЗвонков Цикл
		рс[эл.Ключ]	= эл.Значение;
	КонецЦикла;
	
	Если ДобавлятьСобытия Или рс.Период = '00010101' Тогда
		рс.Период = ТекущаяДатаСеанса(); // НОВАЯ ЗАПИСЬ
	КонецЕсли;

	рс.Записать(Истина); // запись может дополняться ПОСЛЕ создания!  
	
КонецПроцедуры	

// Функция - Получить запись
//
// Параметры:
//  Номер - строка - виртуальный номер
//  Входящий - булево - признак входящий звонок, иначе Исходящий
//  ИдСессии - число - идентификатор сессии звонка
// 
// Возвращаемое значение:
//  Структура, Неопределено - все поля регистра сведений
//
Функция ПолучитьЗапись( Номер = "", Входящий = Истина, ИдСессии = 0 ) Экспорт
	рез = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Входящий", Входящий);
	Запрос.УстановитьПараметр("ИдСессии", ИдСессии); 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ИсторияЗвонков.*
	|ИЗ
	|	РегистрСведений.ИсторияЗвонков.СрезПоследних( ,
	|			Номер = &Номер
	|				И Входящий = &Входящий
	|				И ИдСессии = &ИдСессии) КАК ИсторияЗвонков";
	
	Результат = Запрос.Выполнить(); 
	Если НЕ Результат.Пустой() Тогда 
		табл = Результат.Выгрузить();
		рез = Новый Структура;
		Для каждого ст Из табл.Колонки Цикл
			рез.Вставить(ст.Имя, табл[0][ст.Имя] ); 
		КонецЦикла;
	КонецЕсли;
	
	Возврат рез;
КонецФункции
 
#КонецОбласти