
&НаКлиенте
Процедура СсылкаНаЗаписьОткрытие(Элемент, СтандартнаяОбработка)
	
	Если СтрНайти(Запись.СсылкаНаЗапись, "http") > 0 Тогда 
		СтандартнаяОбработка = Ложь;	
		Попытка  // Доступен, начиная с версии 8.3.18.
			Результат = ЗапуститьПриложениеАсинх( Запись.СсылкаНаЗапись ); // открывает браузер по-умолчанию и открывает файл
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "НЕ удалось открыть запись по ссылке: " + Запись.СсылкаНаЗапись + "
			| " + ОписаниеОшибки();
			Сообщение.Сообщить(); 
		КонецПопытки;	
	КонецЕсли;	
	
КонецПроцедуры

// Функция - Послать сервер
//
// Параметры:
//  стр	 - Структура - структура полей для отправки Centrifugo 
// 
// Возвращаемое значение:
//  булево - признак удачной отправки
//
&НаСервере
Функция ПослатьСервер(стр) 

	Удачно = CentrifugoСервер.ПослатьСообщениеНаКанал( стр );
 
	стр.Канал = ?(стр.Канал = "", CentrifugoСервер.ПолучитьКаналПоНомеру(стр.Номер), стр.Канал); 
	стр.Отправлен = Удачно;

Возврат Удачно;
КонецФункции

&НаКлиенте
Процедура Послать(Команда)  
	стрЗвонка = Новый Структура("Номер, Входящий, Канал, ЗвонящийНомер, ВызываемыйНомер, Отправлен",
									"", Истина, 	"", 			"",				 "", Ложь);
	ЗаполнитьЗначенияСвойств( стрЗвонка, Запись ); 

	Отправлен = ПослатьСервер(стрЗвонка);  

	ЗаполнитьЗначенияСвойств(Запись, стрЗвонка);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ?(Отправлен, "УСПЕШНО ", "НЕ") 
						+ " отправлено сообщение: " + Запись.ЗвонящийНомер 
						+ " в Канал: " + Запись.Канал;
	Сообщение.Поле = "ЗвонящийНомер"; 
	Сообщение.Сообщить();
	
КонецПроцедуры
