
&НаСервере
Функция ПослатьСервер(стрЗвонка) 
	
    стрЗвонка.Канал = ?(стрЗвонка.Канал = "", CentrifugoСервер.ПолучитьКаналПоНомеру( стрЗвонка.Номер ), стрЗвонка.Канал); 
    стрЗвонка.Отправлен = CentrifugoСервер.ПослатьСообщениеНаКанал( стрЗвонка );
	
	Возврат стрЗвонка.Отправлен
	
КонецФункции

&НаКлиенте
Процедура Послать(Команда)  
	стрЗвонка = Новый Структура("Номер, Входящий, Канал, ЗвонящийНомер, ВызываемыйНомер, Отправлен", "", Истина, "", "", "", ЛОЖЬ);
	
	ЗаполнитьЗначенияСвойств( стрЗвонка, Запись ); 
	
	Отправлен = ПослатьСервер(стрЗвонка);  

	ЗаполнитьЗначенияСвойств(Запись, стрЗвонка);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ?(Отправлен, "УСПЕШНО ", "НЕ") + " отправлено сообщение: " + Запись.ЗвонящийНомер + " в Канал: " + Запись.Канал;
	Сообщение.Поле = "ЗвонящийНомер"; 
	//Сообщение.ПутьКДанным = 
	//Сообщение.УстановитьДанные();
	Сообщение.Сообщить();
	
КонецПроцедуры
